Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
       - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/ac012ebf7a8a458e1c1def386c8ec21aaa5d484b3193c717add8ee40b259e0e1.zip" -> "builds/1c0ab5f25097398769427e698c3e3ef9c2cde02516d6d2706e7de12c449d8b15.zip"
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ last_modified                  = "2024-12-10T04:54:05.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (49 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getGenomicVariants",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1c0ab5f25097398769427e698c3e3ef9c2cde02516d6d2706e7de12c449d8b15.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1c0ab5f25097398769427e698c3e3ef9c2cde02516d6d2706e7de12c449d8b15.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1280967788" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ac012ebf7a8a458e1c1def386c8ec21aaa5d484b3193c717add8ee40b259e0e1.zip" -> "builds/1c0ab5f25097398769427e698c3e3ef9c2cde02516d6d2706e7de12c449d8b15.zip"
          ~ "timestamp" = "1733208217192765000" -> "1733901797520227000"
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-getIndividuals-1"
        name             = "sbeacon-backend-getIndividuals-1"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/3d35a776b702b8e74c69454624f0ba5921c5a2e49dd90abcf31efa38a14d8128.zip" -> "builds/328c9f2174437829cac95ba54c4d2d1abff898195f1bdbb72a7b7678bf4ce9e3.zip"
        id                             = "sbeacon-backend-getIndividuals"
      ~ last_modified                  = "2024-12-10T04:53:48.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (49 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getIndividuals",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/328c9f2174437829cac95ba54c4d2d1abff898195f1bdbb72a7b7678bf4ce9e3.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/328c9f2174437829cac95ba54c4d2d1abff898195f1bdbb72a7b7678bf4ce9e3.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "464167793" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3d35a776b702b8e74c69454624f0ba5921c5a2e49dd90abcf31efa38a14d8128.zip" -> "builds/328c9f2174437829cac95ba54c4d2d1abff898195f1bdbb72a7b7678bf4ce9e3.zip"
          ~ "timestamp" = "1733208216244577000" -> "1733901791144229800"
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (47 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "711118710" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216384512000" -> "1733901799843645000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (47 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1745917614" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215871723800" -> "1733901798533160000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1504117130" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733490785299055000" -> "1733901800600408000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_iam_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-getRuns-1"
        name             = "sbeacon-backend-getRuns-1"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f23679a2a686a81f3828197acc015f92642be678eeb3806d3f4a4b009e48e26b.zip" -> "builds/7df89a25a885a4e12d3bb3879f9919e4555490a335a251dd184a0f93f7e90b7f.zip"
        id                             = "sbeacon-backend-getRuns"
      ~ last_modified                  = "2024-12-10T04:54:10.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (49 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getRuns",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7df89a25a885a4e12d3bb3879f9919e4555490a335a251dd184a0f93f7e90b7f.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7df89a25a885a4e12d3bb3879f9919e4555490a335a251dd184a0f93f7e90b7f.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "841967350" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f23679a2a686a81f3828197acc015f92642be678eeb3806d3f4a4b009e48e26b.zip" -> "builds/7df89a25a885a4e12d3bb3879f9919e4555490a335a251dd184a0f93f7e90b7f.zip"
          ~ "timestamp" = "1733208216419596000" -> "1733901800212151000"
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-indexer-0"
        name             = "sbeacon-backend-indexer-0"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (47 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1625542289" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733211137322534000" -> "1733901791118495000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "370546528" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216134814000" -> "1733901790929337000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (32 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1303031516" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215683118200" -> "1733901792722207000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1401269218" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216011071000" -> "1733901800590856000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_policy" "additional_jsons" {
        id               = "arn:aws:iam::209479276142:policy/sbeacon-backend-submitDataset-1"
        name             = "sbeacon-backend-submitDataset-1"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:209479276142:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004/*",
                          - "arn:aws:s3:::gasi-metadata-20241204100806836600000004",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "STAGING"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "GXC"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/b319912a6fb56d69ce8adbf77619db034ce4a877f8370a3bf60747706bf009c9.zip" -> "builds/18cd2fc1b70bb016356d0d1563af1a7cee2a1faae2a515c1db9ae1b00927684e.zip"
        id                             = "sbeacon-backend-submitDataset"
      ~ last_modified                  = "2024-12-10T04:53:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
                # (48 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/submitDataset",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/18cd2fc1b70bb016356d0d1563af1a7cee2a1faae2a515c1db9ae1b00927684e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/18cd2fc1b70bb016356d0d1563af1a7cee2a1faae2a515c1db9ae1b00927684e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-submitDataset.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1572515177" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b319912a6fb56d69ce8adbf77619db034ce4a877f8370a3bf60747706bf009c9.zip" -> "builds/18cd2fc1b70bb016356d0d1563af1a7cee2a1faae2a515c1db9ae1b00927684e.zip"
          ~ "timestamp" = "1733283180799968000" -> "1733901792022590000"
        }
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1224946619" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208215639858000" -> "1733901791118158200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8" -> (known after apply)
      ~ code_sha256                 = "ARRTg1LwxhVOOVAtxd45UZnRhuH5qB8nZPsTg3usi8k=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-12-06T01:03:46.798+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 22994383 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20241204100804138800000002/builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "f7ae3a7190b87115fccd30c223880693-5" -> (known after apply)
      ~ id                            = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> (known after apply)
      ~ key                           = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "644729778" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/14fff1d1178b3e70a290e5e28a8fd8cb14e925458740559f52c5740700adc8d7.zip" -> "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip"
          ~ "timestamp" = "1733446544741369000" -> "1733901791933361000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17" -> (known after apply)
      ~ code_sha256                 = "hnpwk0P+7eBGmmeK7+BMsWZZQ26eYa3TRWc8/lA4T10=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-12-10T04:53:25.153+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:17" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/2de9ebdddb766e4baabd5e2e030491ea9a42617e98f0b4937deb5f840f6c6114.zip" -> "builds/65080021b04d6f4ed92f2414afccf4229982f0316418f63ecdc6560fe3fcc3ea.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 33278 -> (known after apply)
      ~ version                     = "17" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20241204100804138800000002/builds/2de9ebdddb766e4baabd5e2e030491ea9a42617e98f0b4937deb5f840f6c6114.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "c9ebc0da420e0ea540ab5b9c391daa99" -> (known after apply)
      ~ id                            = "builds/2de9ebdddb766e4baabd5e2e030491ea9a42617e98f0b4937deb5f840f6c6114.zip" -> (known after apply)
      ~ key                           = "builds/2de9ebdddb766e4baabd5e2e030491ea9a42617e98f0b4937deb5f840f6c6114.zip" -> "builds/65080021b04d6f4ed92f2414afccf4229982f0316418f63ecdc6560fe3fcc3ea.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/2de9ebdddb766e4baabd5e2e030491ea9a42617e98f0b4937deb5f840f6c6114.zip" -> "builds/65080021b04d6f4ed92f2414afccf4229982f0316418f63ecdc6560fe3fcc3ea.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/65080021b04d6f4ed92f2414afccf4229982f0316418f63ecdc6560fe3fcc3ea.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/65080021b04d6f4ed92f2414afccf4229982f0316418f63ecdc6560fe3fcc3ea.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1442090467" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2de9ebdddb766e4baabd5e2e030491ea9a42617e98f0b4937deb5f840f6c6114.zip" -> "builds/65080021b04d6f4ed92f2414afccf4229982f0316418f63ecdc6560fe3fcc3ea.zip"
          ~ "timestamp" = "1733283180320480200" -> "1733901797322294000"
        }
    }

  # module.svep.module.lambda-concat.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-concat/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/ad42d9048310183beed9b5e927f1819bc968927b121475956760d854f6da118e.zip' 'python3.12' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/55/default/svep/lambda/concat'"
          + "filename_new"   = "builds/ad42d9048310183beed9b5e927f1819bc968927b121475956760d854f6da118e.zip"
          + "filename_old"   = "builds/ad42d9048310183beed9b5e927f1819bc968927b121475956760d854f6da118e.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-concat"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-concat.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-concat/builds/bbbd4511d8c8c5971a63ed0bc58f8d14db2870a0e9bcc7ab6ec3b1d024c7fa9b.zip" -> (known after apply)
        id                             = "svep-backend-concat"
      ~ last_modified                  = "2024-12-04T10:08:25.139+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.12"
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-concat.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1985254969" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/bbbd4511d8c8c5971a63ed0bc58f8d14db2870a0e9bcc7ab6ec3b1d024c7fa9b.zip" -> "builds/ad42d9048310183beed9b5e927f1819bc968927b121475956760d854f6da118e.zip"
        }
    }

  # module.svep.module.lambda-concatPages.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-concatPages/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/be3d19313ff9d98e1abd03a055a2998035d44f8d564489c9ccbb8e649e81173d.zip' 'python3.12' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/55/default/svep/lambda/concatPages'"
          + "filename_new"   = "builds/be3d19313ff9d98e1abd03a055a2998035d44f8d564489c9ccbb8e649e81173d.zip"
          + "filename_old"   = "builds/be3d19313ff9d98e1abd03a055a2998035d44f8d564489c9ccbb8e649e81173d.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-concatPages"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-concatPages.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-concatPages/builds/3cadda169cdfe5ba7c8bfe03c46938bb12e36a52b6ab4184a08ab64e8e0c6ec6.zip" -> (known after apply)
        id                             = "svep-backend-concatPages"
      ~ last_modified                  = "2024-12-04T10:09:14.604+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.12"
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-concatPages.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "877586477" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/3cadda169cdfe5ba7c8bfe03c46938bb12e36a52b6ab4184a08ab64e8e0c6ec6.zip" -> "builds/be3d19313ff9d98e1abd03a055a2998035d44f8d564489c9ccbb8e649e81173d.zip"
        }
    }

  # module.svep.module.lambda-concatStarter.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-concatStarter/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/54fe81ebd7a8536fda65ccd38123299f9078ea6a7a6b0879539ef66aa90a5cd2.zip' 'python3.12' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/55/default/svep/lambda/concatStarter'"
          + "filename_new"   = "builds/54fe81ebd7a8536fda65ccd38123299f9078ea6a7a6b0879539ef66aa90a5cd2.zip"
          + "filename_old"   = "builds/54fe81ebd7a8536fda65ccd38123299f9078ea6a7a6b0879539ef66aa90a5cd2.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-concatStarter"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-concatStarter.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-concatStarter/builds/3e1b36e8fa7448ec4b3e17e118f56cee49b7cd87d3be230cd7228de2b71d796a.zip" -> (known after apply)
        id                             = "svep-backend-concatStarter"
      ~ last_modified                  = "2024-12-04T10:08:19.577+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.12"
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-concatStarter.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "543781829" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/3e1b36e8fa7448ec4b3e17e118f56cee49b7cd87d3be230cd7228de2b71d796a.zip" -> "builds/54fe81ebd7a8536fda65ccd38123299f9078ea6a7a6b0879539ef66aa90a5cd2.zip"
        }
    }

  # module.svep.module.lambda-createPages.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-createPages/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/68080aca989f39553c1bceb3f835ec8095ece2509a33a42d763db3a43d254108.zip' 'python3.12' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/55/default/svep/lambda/createPages'"
          + "filename_new"   = "builds/68080aca989f39553c1bceb3f835ec8095ece2509a33a42d763db3a43d254108.zip"
          + "filename_old"   = "builds/68080aca989f39553c1bceb3f835ec8095ece2509a33a42d763db3a43d254108.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-createPages"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-createPages.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-createPages/builds/b33ca0f3211ecd49e94012e372419a023a01147ed0df87745d5af444765bae3c.zip" -> (known after apply)
        id                             = "svep-backend-createPages"
      ~ last_modified                  = "2024-12-04T10:09:20.155+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.12"
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-createPages.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1821935568" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/b33ca0f3211ecd49e94012e372419a023a01147ed0df87745d5af444765bae3c.zip" -> "builds/68080aca989f39553c1bceb3f835ec8095ece2509a33a42d763db3a43d254108.zip"
        }
    }

  # module.svep.module.lambda-getResultsURL.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-getResultsURL/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/c0088457a5b029dd0dc5ba5255f848118f63ca8a05b9a2318bb613e7ec856372.zip' 'python3.12' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/55/default/svep/lambda/getResultsURL'"
          + "filename_new"   = "builds/c0088457a5b029dd0dc5ba5255f848118f63ca8a05b9a2318bb613e7ec856372.zip"
          + "filename_old"   = "builds/c0088457a5b029dd0dc5ba5255f848118f63ca8a05b9a2318bb613e7ec856372.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-getResultsURL"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-getResultsURL.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-getResultsURL/builds/7fdf2160679efa1602859b12dc0752d9158a618e921a76a8c29048e766e7e612.zip" -> (known after apply)
        id                             = "svep-backend-getResultsURL"
      ~ last_modified                  = "2024-12-04T10:09:09.015+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.12"
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-getResultsURL.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1561084150" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/7fdf2160679efa1602859b12dc0752d9158a618e921a76a8c29048e766e7e612.zip" -> "builds/c0088457a5b029dd0dc5ba5255f848118f63ca8a05b9a2318bb613e7ec856372.zip"
        }
    }

  # module.svep.module.lambda-initQuery.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-initQuery/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/580628a04e108dc5c5880abe7fb494ac1737f16d67a2063ec2128e8fc7ad4e7f.zip' 'python3.12' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/55/default/svep/lambda/initQuery'"
          + "filename_new"   = "builds/580628a04e108dc5c5880abe7fb494ac1737f16d67a2063ec2128e8fc7ad4e7f.zip"
          + "filename_old"   = "builds/580628a04e108dc5c5880abe7fb494ac1737f16d67a2063ec2128e8fc7ad4e7f.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-initQuery"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-initQuery.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "590934221" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/e18925bc0a8dcadc34c43bf86b94f73561964f705d1daef21ca46f80f4cbef4f.zip" -> "builds/580628a04e108dc5c5880abe7fb494ac1737f16d67a2063ec2128e8fc7ad4e7f.zip"
        }
    }

  # module.svep.module.lambda-pluginUpdownstream.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-pluginUpdownstream/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/5cf94379522643261174024542eedc4f658297bbd239a688e8df651eaaf95981.zip' 'python3.12' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/55/default/svep/lambda/pluginUpdownstream'"
          + "filename_new"   = "builds/5cf94379522643261174024542eedc4f658297bbd239a688e8df651eaaf95981.zip"
          + "filename_old"   = "builds/5cf94379522643261174024542eedc4f658297bbd239a688e8df651eaaf95981.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-pluginUpdownstream"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-pluginUpdownstream.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1067543148" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/53c078bfb2f0fd8e34d7acaaa1adad4ca9867673421d83d26f34901121b52fc5.zip" -> "builds/5cf94379522643261174024542eedc4f658297bbd239a688e8df651eaaf95981.zip"
        }
    }

  # module.svep.module.lambda-queryGTF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryGTF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/e5d6b956ef5f9925f05c6796111c26448e228834cc989c949aaf1a0e7555cfbe.zip' 'python3.12' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/55/default/svep/lambda/queryGTF'"
          + "filename_new"   = "builds/e5d6b956ef5f9925f05c6796111c26448e228834cc989c949aaf1a0e7555cfbe.zip"
          + "filename_old"   = "builds/e5d6b956ef5f9925f05c6796111c26448e228834cc989c949aaf1a0e7555cfbe.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryGTF"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryGTF.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1209031891" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/77f5fc22505268186132cdca6ade70c9eeb2d8bf7e8d2a32c607cc2fa4f8324a.zip" -> "builds/e5d6b956ef5f9925f05c6796111c26448e228834cc989c949aaf1a0e7555cfbe.zip"
        }
    }

  # module.svep.module.lambda-queryVCF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/3fe739d16b58d90c0c2f1a6c08aaa1eff0b7ad09ac24e21db051d19bba03e27d.zip' 'python3.12' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/55/default/svep/lambda/queryVCF'"
          + "filename_new"   = "builds/3fe739d16b58d90c0c2f1a6c08aaa1eff0b7ad09ac24e21db051d19bba03e27d.zip"
          + "filename_old"   = "builds/3fe739d16b58d90c0c2f1a6c08aaa1eff0b7ad09ac24e21db051d19bba03e27d.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCF"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryVCF.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1891433180" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/ac23f91ad883fa7055de235e487b199ddd46c5e63cbf0aaf02d87538889124a0.zip" -> "builds/3fe739d16b58d90c0c2f1a6c08aaa1eff0b7ad09ac24e21db051d19bba03e27d.zip"
        }
    }

  # module.svep.module.lambda-queryVCFsubmit.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCFsubmit/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/bcf920ed71b9dc7fce2e7ebee6b8a5db02be2740c0f83e6e87595d636b6cdd3f.zip' 'python3.12' '/atlantis-data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/55/default/svep/lambda/queryVCFsubmit'"
          + "filename_new"   = "builds/bcf920ed71b9dc7fce2e7ebee6b8a5db02be2740c0f83e6e87595d636b6cdd3f.zip"
          + "filename_old"   = "builds/bcf920ed71b9dc7fce2e7ebee6b8a5db02be2740c0f83e6e87595d636b6cdd3f.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCFsubmit"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryVCFsubmit.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-queryVCFsubmit/builds/14485579e9c0f4949dfdd464367d34950ff3312e980c1e1a6304ff94fef590ae.zip" -> (known after apply)
        id                             = "svep-backend-queryVCFsubmit"
      ~ last_modified                  = "2024-12-04T10:08:30.653+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ runtime                        = "python3.9" -> "python3.12"
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1897834596" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/14485579e9c0f4949dfdd464367d34950ff3312e980c1e1a6304ff94fef590ae.zip" -> "builds/bcf920ed71b9dc7fce2e7ebee6b8a5db02be2740c0f83e6e87595d636b6cdd3f.zip"
        }
    }

  # module.svep.module.python_modules_layer.aws_lambda_layer_version.this[0] will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + description                 = "python libraries"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "svep_backend_python_modules_layer"
      + s3_bucket                   = (known after apply)
      + s3_key                      = "builds/4caa1e650c747ca29982f11f5a690076d2434c1d407295ea8bf072db0a179360.zip"
      + s3_object_version           = (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.svep.module.python_modules_layer.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "builds/4caa1e650c747ca29982f11f5a690076d2434c1d407295ea8bf072db0a179360.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "builds/4caa1e650c747ca29982f11f5a690076d2434c1d407295ea8bf072db0a179360.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.svep.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/4caa1e650c747ca29982f11f5a690076d2434c1d407295ea8bf072db0a179360.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/4caa1e650c747ca29982f11f5a690076d2434c1d407295ea8bf072db0a179360.plan.json"
      + id                   = (known after apply)
    }

  # module.svep.module.python_modules_layer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/4caa1e650c747ca29982f11f5a690076d2434c1d407295ea8bf072db0a179360.zip"
          + "timestamp" = "1733901792033327200"
        }
    }

Plan: 58 to add, 46 to change, 37 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.svep.aws_api_gateway_deployment.VPApi,
│   on svep/api.tf line 281, in resource "aws_api_gateway_deployment" "VPApi":
│  281:   stage_name  = "prod"
│ 
│ The attribute "stage_name" will be removed in a future major version. Use
│ an explicit "aws_api_gateway_stage" instead.
╵
╷
│ Error: Error pinging Docker server: Cannot connect to the Docker daemon at unix:///var/run/docker.sock. Is the docker daemon running?
│ 
│   with module.svep.provider["registry.terraform.io/kreuzwerker/docker"],
│   on svep/docker_images.tf line 3, in provider "docker":
│    3: provider "docker" {
│ 
╵
╷
│ Error: Archive creation error
│ 
│   with module.svep.data.archive_file.binaries_layer,
│   on svep/layers.tf line 3, in data "archive_file" "binaries_layer":
│    3: data "archive_file" "binaries_layer" {
│ 
│ error creating archive: error archiving directory: could not archive
│ missing directory: svep/layers/binaries/
╵


```
</details>